RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* SUB reg to reg and invert result with ROR */
#define E_SUBN_ROR(dest, src1, src2, shift5)                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_SUBN_RORS(dest, src1, src2, shift5)                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_SUBN_ROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_SUBN_RORS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)

/* Flip Endianness and then shift5/Rotate */

/* Sub reg to reg with Flip */
#define E_SUB_F(dest, src1, src2)                                                                                   \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_SUB_FS(dest, src1, src2)                                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_SUB_F(cond, dest, src1, src2)                                                                          \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_COND_SUB_FS(cond, dest, src1, src2)                                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)

/* Sub reg to reg and invert result with Flip */
#define E_SUBN_F(dest, src1, src2)                                                                                  \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_SUBN_FS(dest, src1, src2)                                                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUBN_F(cond, dest, src1, src2)                                                                         \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_SUBN_FS(cond, dest, src1, src2)                                                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* SUB reg to reg with Post Shift Left */
#define E_SUB_FLSL(dest, src1, src2, shift5)                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_SUB_FLSLS(dest, src1, src2, shift5)                                                               \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUB_FLSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_SUB_FLSLS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* SUB reg to reg and invert result with Post Shift Left */
#define E_SUBN_FLSL(dest, src1, src2, shift5)                                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_SUBN_FLSLS(dest, src1, src2, shift5)                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUBN_FLSL(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUBN_FLSLS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)

/* SUB reg to reg with Post Shift Right */
#define E_SUB_FLSR(dest, src1, src2, shift5)                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_SUB_FLSRS(dest, src1, src2, shift5)                                                               \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SUB_FLSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_SUB_FLSRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)

/* SUB reg to reg and invert result with Post Shift Right */
#define E_SUBN_FLSR(dest, src1, src2, shift5)                                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_SUBN_FLSRS(dest, src1, src2, shift5)                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SUBN_FLSR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SUBN_FLSRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)

/* SUB reg to reg with Post Arith Shift Right */
#define E_SUB_FASR(dest, src1, src2, shift5)                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_SUB_FASRS(dest, src1, src2, shift5)                                                               \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUB_FASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_SUB_FASRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)

/* SUB reg to reg and invert result with Post Arith Shift Right */
#define E_SUBN_FASR(dest, src1, src2, shift5)                                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_SUBN_FASRS(dest, src1, src2, shift5)                                                \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUBN_FASR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_SUBN_FASRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)

/* SUB reg to reg with Post ROR */
#define E_SUB_FROR(dest, src1, src2, shift5)                                                                 \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_SUB_FRORS(dest, src1, src2, shift5)                                                               \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SUB_FROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_SUB_FRORS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x8 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)

