RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* ADC reg to reg with Post Arith Shift Right */
#define E_ADC_ASR(dest, src1, src2, shift5)                                                                  \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_ADC_ASRS(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADC_ASR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_ADC_ASRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)

/* ADC reg to reg and invert result with Post Arith Shift Right */
#define E_ADCN_ASR(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_ADCN_ASRS(dest, src1, src2, shift5)                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADCN_ASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ADCN_ASRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)

/* ADC reg to reg with Post ROR */
#define E_ADC_ROR(dest, src1, src2, shift5)                                                                  \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_ADC_RORS(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADC_ROR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_ADC_RORS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)

/* ADC reg to reg and invert result with ROR */
#define E_ADCN_ROR(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_ADCN_RORS(dest, src1, src2, shift5)                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADCN_ROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ADCN_RORS(cond, dest, src1, src2, shift5)                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)

/* Flip Endianness and then shift5/Rotate */

/* adc reg to reg with Flip */
#define E_ADC_F(dest, src1, src2)                                                                                   \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_ADC_FS(dest, src1, src2)                                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ADC_F(cond, dest, src1, src2)                                                                          \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_COND_ADC_FS(cond, dest, src1, src2)                                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)

/* ADC reg to reg and invert result with Flip */
#define E_ADCN_F(dest, src1, src2)                                                                                  \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_ADCN_FS(dest, src1, src2)                                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADCN_F(cond, dest, src1, src2)                                                                         \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ADCN_FS(cond, dest, src1, src2)                                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* ADC reg to reg with Post Shift Left */
#define E_ADC_FLSL(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_ADC_FLSLS(dest, src1, src2, shift5)                                                               \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADC_FLSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ADC_FLSLS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* ADC reg to reg and invert result with Post Shift Left */
#define E_ADCN_FLSL(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_ADCN_FLSLS(dest, src1, src2, shift5)                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADCN_FLSL(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADCN_FLSLS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)

/* ADC reg to reg with Post Shift Right */
#define E_ADC_FLSR(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_ADC_FLSRS(dest, src1, src2, shift5)                                                               \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADC_FLSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_ADC_FLSRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)

/* ADC reg to reg and invert result with Post Shift Right */
#define E_ADCN_FLSR(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_ADCN_FLSRS(dest, src1, src2, shift5)                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADCN_FLSR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADCN_FLSRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)

