RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* ADC reg to reg with Post Arith Shift Right */
#define E_ADC_FASR(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_ADC_FASRS(dest, src1, src2, shift5)                                                               \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADC_FASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ADC_FASRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)

/* ADC reg to reg and invert result with Post Arith Shift Right */
#define E_ADCN_FASR(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_ADCN_FASRS(dest, src1, src2, shift5)                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADCN_FASR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ADCN_FASRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)

/* ADC reg to reg with Post ROR */
#define E_ADC_FROR(dest, src1, src2, shift5)                                                                 \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_ADC_FRORS(dest, src1, src2, shift5)                                                               \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADC_FROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_ADC_FRORS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)

/* ADC reg to reg and invert result with ROR */
#define E_ADCN_FROR(dest, src1, src2, shift5)                                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_ADCN_FRORS(dest, src1, src2, shift5)                                                \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADCN_FROR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ADCN_FRORS(cond, dest, src1, src2, shift5)                                       \
    DCD 0x9 + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_SBC Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              src2 SFlag Cond
 */
/*                                                         Imm            Use_Imm      Invert Result    Shift Result */

/* carry sub reg from reg */
#define E_SBC(dest, src1, src2)            DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5)
#define E_SBCS(dest, src1, src2)           DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5)
#define E_COND_SBC(cond, dest, src1, src2) DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5)
#define E_COND_SBCS(cond, dest, src1, src2) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5)

/* carry sub reg from reg and invert result */
#define E_SBCN(dest, src1, src2) DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19)
#define E_SBCNS(dest, src1, src2) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19)
#define E_COND_SBCN(cond, dest, src1, src2) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19)
#define E_COND_SBCNS(cond, dest, src1, src2) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19)

/* carry sub imm12s from reg */
#define E_SBC_IMM(dest, src1, imm12s) DCD 0xA + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_SBC_IMMS(dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_SBC_IMM(cond, dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_SBC_IMMS(cond, dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18)

/* carry sub imm12s from reg and invert result */
#define E_SBCN_IMM(dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_SBCN_IMMS(dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_SBCN_IMM(cond, dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_SBCN_IMMS(cond, dest, src1, imm12s) \
    DCD 0xA + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)

/* SBC reg to reg with Post Shift Left */
#define E_SBC_LSL(dest, src1, src2, shift5)                                                                  \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_SBC_LSLS(dest, src1, src2, shift5)                                                                \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_SBC_LSL(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_SBC_LSLS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)

