RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* SBC reg to reg and invert result with ROR */
#define E_SBCN_FROR(dest, src1, src2, shift5)                                                                \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_SBCN_FRORS(dest, src1, src2, shift5)                                                \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SBCN_FROR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_SBCN_FRORS(cond, dest, src1, src2, shift5)                                       \
    DCD 0xA + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_OR Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              src2 SFlag Cond
 */
/*                                                         Imm            Use_Imm      Invert Result    Shift Result */

/* or reg with reg */
#define E_OR(dest, src1, src2)             DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5)
#define E_ORS(dest, src1, src2)            DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5)
#define E_COND_OR(cond, dest, src1, src2)  DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5)
#define E_COND_ORS(cond, dest, src1, src2) DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5)

/* or reg with reg and invert result */
#define E_ORN(dest, src1, src2)  DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19)
#define E_ORNS(dest, src1, src2) DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19)
#define E_COND_ORN(cond, dest, src1, src2) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19)
#define E_COND_ORNS(cond, dest, src1, src2) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19)

/* or imm12s with reg */
#define E_OR_IMM(dest, src1, imm12s) DCD 0xC + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_OR_IMMS(dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_OR_IMM(cond, dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_OR_IMMS(cond, dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18)

/* or imm12s with reg and invert result */
#define E_ORN_IMM(dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_ORN_IMMS(dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ORN_IMM(cond, dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ORN_IMMS(cond, dest, src1, imm12s) \
    DCD 0xC + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)

/* OR reg to reg with Post Shift Left */
#define E_OR_LSL(dest, src1, src2, shift5)                                                                   \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_OR_LSLS(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_OR_LSL(cond, dest, src1, src2, shift5)                                                          \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_OR_LSLS(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)

/* OR reg to reg and invert result with Post Shift Left */
#define E_ORN_LSL(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_ORN_LSLS(dest, src1, src2, shift5)                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ORN_LSL(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ORN_LSLS(cond, dest, src1, src2, shift5)                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)

