RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* OR reg to reg with Post Shift Right */
#define E_OR_LSR(dest, src1, src2, shift5)                                                                   \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_OR_LSRS(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_OR_LSR(cond, dest, src1, src2, shift5)                                                          \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_OR_LSRS(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)

/* OR reg to reg and invert result with Post Shift Right */
#define E_ORN_LSR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_ORN_LSRS(dest, src1, src2, shift5)                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ORN_LSR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ORN_LSRS(cond, dest, src1, src2, shift5)                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)

/* OR reg to reg with Post Arith Shift Right */
#define E_OR_ASR(dest, src1, src2, shift5)                                                                   \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_OR_ASRS(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_OR_ASR(cond, dest, src1, src2, shift5)                                                          \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_OR_ASRS(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)

/* OR reg to reg and invert result with Post Arith Shift Right */
#define E_ORN_ASR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_ORN_ASRS(dest, src1, src2, shift5)                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ORN_ASR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ORN_ASRS(cond, dest, src1, src2, shift5)                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)

/* OR reg to reg with Post ROR */
#define E_OR_ROR(dest, src1, src2, shift5)                                                                   \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_OR_RORS(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_OR_ROR(cond, dest, src1, src2, shift5)                                                          \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_OR_RORS(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)

/* OR reg to reg and invert result with ROR */
#define E_ORN_ROR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_ORN_RORS(dest, src1, src2, shift5)                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ORN_ROR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ORN_RORS(cond, dest, src1, src2, shift5)                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
/* Flip Endianness and then shift5/Rotate */

/* OR reg to reg with Flip */
#define E_OR_F(dest, src1, src2)                                                                                    \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_OR_FS(dest, src1, src2)                                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_OR_F(cond, dest, src1, src2)                                                                           \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_COND_OR_FS(cond, dest, src1, src2)                                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)

/* OR reg to reg and invert result with Flip */
#define E_ORN_F(dest, src1, src2)                                                                                   \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_ORN_FS(dest, src1, src2)                                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ORN_F(cond, dest, src1, src2)                                                                          \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ORN_FS(cond, dest, src1, src2)                                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* OR reg to reg with Post Shift Left */
#define E_OR_FLSL(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_OR_FLSLS(dest, src1, src2, shift5)                                                                \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_OR_FLSL(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_OR_FLSLS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* OR reg to reg and invert result with Post Shift Left */
#define E_ORN_FLSL(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_ORN_FLSLS(dest, src1, src2, shift5)                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ORN_FLSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ORN_FLSLS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)

