RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* OR reg to reg with Post Shift Right */
#define E_OR_FLSR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_OR_FLSRS(dest, src1, src2, shift5)                                                                \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_OR_FLSR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_OR_FLSRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)

/* OR reg to reg and invert result with Post Shift Right */
#define E_ORN_FLSR(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_ORN_FLSRS(dest, src1, src2, shift5)                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ORN_FLSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ORN_FLSRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)

/* OR reg to reg with Post Arith Shift Right */
#define E_OR_FASR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_OR_FASRS(dest, src1, src2, shift5)                                                                \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_OR_FASR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_OR_FASRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)

/* OR reg to reg and invert result with Post Arith Shift Right */
#define E_ORN_FASR(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_ORN_FASRS(dest, src1, src2, shift5)                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ORN_FASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ORN_FASRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)

/* OR reg to reg with Post ROR */
#define E_OR_FROR(dest, src1, src2, shift5)                                                                  \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_OR_FRORS(dest, src1, src2, shift5)                                                                \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_OR_FROR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_OR_FRORS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)

/* OR reg to reg and invert result with ROR */
#define E_ORN_FROR(dest, src1, src2, shift5)                                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_ORN_FRORS(dest, src1, src2, shift5)                                                 \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ORN_FROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ORN_FRORS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xC + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_AND Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              src2 SFlag Cond
 */
/*                                                         Imm            Use_Imm      Invert Result    Shift Result */

/* AND reg with reg */
#define E_AND(dest, src1, src2)            DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5)
#define E_ANDS(dest, src1, src2)           DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5)
#define E_COND_AND(cond, dest, src1, src2) DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5)
#define E_COND_ANDS(cond, dest, src1, src2) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5)

/* AND reg with reg and invert result */
#define E_ANDN(dest, src1, src2) DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19)
#define E_ANDNS(dest, src1, src2) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19)
#define E_COND_ANDN(cond, dest, src1, src2) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19)
#define E_COND_ANDNS(cond, dest, src1, src2) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19)

/* AND imm12s with reg */
#define E_AND_IMM(dest, src1, imm12s) DCD 0xd + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_AND_IMMS(dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_AND_IMM(cond, dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18)
#define E_COND_AND_IMMS(cond, dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18)

/* AND imm12s with reg and invert result */
#define E_ANDN_IMM(dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_ANDN_IMMS(dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (1 << 9) + (EU << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ANDN_IMM(cond, dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)
#define E_COND_ANDN_IMMS(cond, dest, src1, imm12s) \
    DCD 0xd + (dest << 10) + (src1 << 14) + (1 << 9) + (cond << 5) + (imm12s << 20) + (1 << 18) + (1 << 19)

/* AND reg to reg with Post Shift Left */
#define E_AND_LSL(dest, src1, src2, shift5)                                                                  \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_AND_LSLS(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_AND_LSL(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_AND_LSLS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)

