RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* AND reg to reg and invert result with Post Shift Left */
#define E_ANDN_LSL(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_ANDN_LSLS(dest, src1, src2, shift5)                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ANDN_LSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ANDN_LSLS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (0 << 31)

/* AND reg to reg with Post Shift Right */
#define E_AND_LSR(dest, src1, src2, shift5)                                                                  \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_AND_LSRS(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_AND_LSR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_AND_LSRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)

/* AND reg to reg and invert result with Post Shift Right */
#define E_ANDN_LSR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_ANDN_LSRS(dest, src1, src2, shift5)                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ANDN_LSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ANDN_LSRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (0 << 31)

/* AND reg to reg with Post Arith Shift Right */
#define E_AND_ASR(dest, src1, src2, shift5)                                                                  \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_AND_ASRS(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_AND_ASR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (0 << 31)
#define E_COND_AND_ASRS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)

/* AND reg to reg and invert result with Post Arith Shift Right */
#define E_ANDN_ASR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_ANDN_ASRS(dest, src1, src2, shift5)                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ANDN_ASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (0 << 31)
#define E_COND_ANDN_ASRS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (0 << 31)

/* AND reg to reg with Post ROR */
#define E_AND_ROR(dest, src1, src2, shift5)                                                                  \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_AND_RORS(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_AND_ROR(cond, dest, src1, src2, shift5)                                                         \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (0 << 31)
#define E_COND_AND_RORS(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)

/* AND reg to reg and invert result with ROR */
#define E_ANDN_ROR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_ANDN_RORS(dest, src1, src2, shift5)                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ANDN_ROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (0 << 31)
#define E_COND_ANDN_RORS(cond, dest, src1, src2, shift5)                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (0 << 31)

/* Flip Endianness and then shift5/Rotate */

/* AND reg to reg with Flip */
#define E_AND_F(dest, src1, src2)                                                                                   \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_AND_FS(dest, src1, src2)                                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_AND_F(cond, dest, src1, src2)                                                                          \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + (0 << 30) + \
        (1 << 31)
#define E_COND_AND_FS(cond, dest, src1, src2)                                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)

/* AND reg to reg and invert result with Flip */
#define E_ANDN_F(dest, src1, src2)                                                                                  \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_ANDN_FS(dest, src1, src2)                                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ANDN_F(cond, dest, src1, src2)                                                                         \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_ANDN_FS(cond, dest, src1, src2)                                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + ((0 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

/* AND reg to reg with Post Shift Left */
#define E_AND_FLSL(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_AND_FLSLS(dest, src1, src2, shift5)                                                               \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_AND_FLSL(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_AND_FLSLS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)

