RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* AND reg to reg and invert result with Post Shift Left */
#define E_ANDN_FLSL(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_ANDN_FLSLS(dest, src1, src2, shift5)                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ANDN_FLSL(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ANDN_FLSLS(cond, dest, src1, src2, shift5)                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (0 << 30) + (1 << 31)

/* AND reg to reg with Post Shift Right */
#define E_AND_FLSR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_AND_FLSRS(dest, src1, src2, shift5)                                                               \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_AND_FLSR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_AND_FLSRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)

/* AND reg to reg and invert result with Post Shift Right */
#define E_ANDN_FLSR(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_ANDN_FLSRS(dest, src1, src2, shift5)                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ANDN_FLSR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (0 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ANDN_FLSRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (0 << 29) + (1 << 30) + (1 << 31)

/* AND reg to reg with Post Arith Shift Right */
#define E_AND_FASR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_AND_FASRS(dest, src1, src2, shift5)                                                               \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_AND_FASR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (0 << 30) + (1 << 31)
#define E_COND_AND_FASRS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)

/* AND reg to reg and invert result with Post Arith Shift Right */
#define E_ANDN_FASR(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_ANDN_FASRS(dest, src1, src2, shift5)                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ANDN_FASR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 30) + (1 << 31)
#define E_COND_ANDN_FASRS(cond, dest, src1, src2, shift5)                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (0 << 30) + (1 << 31)

/* AND reg to reg with Post ROR */
#define E_AND_FROR(dest, src1, src2, shift5)                                                                 \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_AND_FRORS(dest, src1, src2, shift5)                                                               \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_AND_FROR(cond, dest, src1, src2, shift5)                                                        \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + ((shift5 & 0x1f) << 24) + (1 << 29) + \
        (1 << 30) + (1 << 31)
#define E_COND_AND_FRORS(cond, dest, src1, src2, shift5)                                                      \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)

/* AND reg to reg and invert result with ROR */
#define E_ANDN_FROR(dest, src1, src2, shift5)                                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_ANDN_FRORS(dest, src1, src2, shift5)                                                \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ANDN_FROR(cond, dest, src1, src2, shift5)                                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5) + (1 << 19) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 30) + (1 << 31)
#define E_COND_ANDN_FRORS(cond, dest, src1, src2, shift5)                                       \
    DCD 0xd + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5) + (1 << 19) + \
        ((shift5 & 0x1f) << 24) + (1 << 29) + (1 << 30) + (1 << 31)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_XOR Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              src2 SFlag Cond
 */
/*                                                         Imm            Use_Imm      Invert Result    Shift Result */

/* XOR reg with reg */
#define E_XOR(dest, src1, src2)            DCD 0xe + (dest << 10) + (src1 << 14) + (src2 << 20) + (EU << 5)
#define E_XORS(dest, src1, src2)           DCD 0xe + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (EU << 5)
#define E_COND_XOR(cond, dest, src1, src2) DCD 0xe + (dest << 10) + (src1 << 14) + (src2 << 20) + (cond << 5)
#define E_COND_XORS(cond, dest, src1, src2) \
    DCD 0xe + (dest << 10) + (src1 << 14) + (src2 << 20) + (1 << 9) + (cond << 5)

