RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Logical Shift */
#define E_LSL(dest, r2shift, shift5)                                                                         \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18)
#define E_LSR(dest, r2shift, shift5)                                                                         \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag */
#define E_LSLS(dest, r2shift, shift5)                                                                        \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18)
#define E_LSRS(dest, r2shift, shift5)                                                                        \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18)

/* Logical Shift and then AND */
#define E_LSL_AND(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_AND(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then AND */
#define E_LSL_ANDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ANDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then OR */
#define E_LSL_OR(dest, roperand, r2shift, shift5)                                                                   \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_OR(dest, roperand, r2shift, shift5)                                                                   \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then OR */
#define E_LSL_ORS(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ORS(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then XOR */
#define E_LSL_XOR(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_XOR(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then XOR */
#define E_LSL_XORS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_XORS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then ADD */
#define E_LSL_ADD(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ADD(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADD */
#define E_LSL_ADDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ADDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SUB */
#define E_LSL_SUB(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_SUB(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SUB */
#define E_LSL_SUBS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_SUBS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then ADC */
#define E_LSL_ADC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ADC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADC */
#define E_LSL_ADCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_ADCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SBC */
#define E_LSL_SBC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_SBC(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SBC */
#define E_LSL_SBCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_LSR_SBCS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)

/* Conditional */
/* Logical Shift */
#define E_COND_LSL(cond, dest, r2shift, shift5)                                                                \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18)
#define E_COND_LSR(cond, dest, r2shift, shift5)                                                                \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag */
#define E_COND_LSLS(cond, dest, r2shift, shift5)                                                               \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 19) + (0 << 18)
#define E_COND_LSRS(cond, dest, r2shift, shift5)                                                               \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (0 << 18)

/* Logical Shift and then AND */
#define E_COND_LSL_AND(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_AND(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then AND */
#define E_COND_LSL_ANDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ANDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then OR */
#define E_COND_LSL_OR(cond, dest, roperand, r2shift, shift5)                                                          \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_OR(cond, dest, roperand, r2shift, shift5)                                                          \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then OR */
#define E_COND_LSL_ORS(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ORS(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then XOR */
#define E_COND_LSL_XOR(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_XOR(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then XOR */
#define E_COND_LSL_XORS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_XORS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18)

