RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Logical Shift and then ADD */
#define E_COND_LSL_ADD(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ADD(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADD */
#define E_COND_LSL_ADDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ADDS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SUB */
#define E_COND_LSL_SUB(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_SUB(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SUB */
#define E_COND_LSL_SUBS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_SUBS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then ADC */
#define E_COND_LSL_ADC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ADC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADC */
#define E_COND_LSL_ADCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_ADCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SBC */
#define E_COND_LSL_SBC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_SBC(cond, dest, roperand, r2shift, shift5)                                                         \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SBC */
#define E_COND_LSL_SBCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_COND_LSR_SBCS(cond, dest, roperand, r2shift, shift5)                                                        \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_ROTATE Codes */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Left/Right
 */
/*                                                         Shift/Rotate */

/* Rotate */
#define E_ROR(dest, r2shift, shift5)                                                                         \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18)
/* Rotate and Set Flag */
#define E_RORS(dest, r2shift, shift5)                                                                        \
    DCD 0x10 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 19) + (1 << 18)

/* Rotate and then AND */
#define E_ROR_AND(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then AND */
#define E_ROR_ANDS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then OR */
#define E_ROR_OR(dest, roperand, r2shift, shift5)                                                                   \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then OR */
#define E_ROR_ORS(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18)

/* Rotate and then XOR */
#define E_ROR_XOR(dest, roperand, r2shift, shift5)                                                                  \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18)
/* Rotate and Set Flag then XOR */
#define E_ROR_XORS(dest, roperand, r2shift, shift5)                                                                 \
    DCD 0x10 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18)

