RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Conditional Flip Endian , ASR , ADC */
#define E_COND_FEND_ASR_ADC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then ADC */
#define E_COND_FEND_ASR_ADCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (1 << 19)

/* Conditional Flip Endian , ASR , SBC */
#define E_COND_FEND_ASR_SBC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (1 << 19)
/* Conditional Flip Endian , ASR ,Set Flag then SBC */
#define E_COND_FEND_ASR_SBCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (1 << 19)

/* Bitwise Flip ASR */

/* Flip Bitwise , ASR Right */
#define E_FBIT_ASR(dest, r2shift, shift5)                                                                    \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag */
#define E_FBIT_ASRS(dest, r2shift, shift5)                                                                   \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , AND */
#define E_FBIT_ASR_AND(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then AND */
#define E_FBIT_ASR_ANDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , OR */
#define E_FBIT_ASR_OR(dest, roperand, r2shift, shift5)                                                              \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then OR */
#define E_FBIT_ASR_ORS(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , XOR */
#define E_FBIT_ASR_XOR(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then XOR */
#define E_FBIT_ASR_XORS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , ADD */
#define E_FBIT_ASR_ADD(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then ADD */
#define E_FBIT_ASR_ADDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , SUB */
#define E_FBIT_ASR_SUB(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then SUB */
#define E_FBIT_ASR_SUBS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , ADC */
#define E_FBIT_ASR_ADC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then ADC */
#define E_FBIT_ASR_ADCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (1 << 19)

/* Flip Bitwise , ASR Right , SBC */
#define E_FBIT_ASR_SBC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (1 << 19)
/* Flip Bitwise , ASR Right ,Set Flag then SBC */
#define E_FBIT_ASR_SBCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (1 << 19)

/* Conditional */
/* Conditional Flip Bitwise , ASR */
#define E_COND_FBIT_ASR(cond, dest, r2shift, shift5)                                                           \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag */
#define E_COND_FBIT_ASRS(cond, dest, r2shift, shift5)                                                          \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (1 << 19)

