RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Conditional Flip Bitwise , ASR , AND */
#define E_COND_FBIT_ASR_AND(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then AND */
#define E_COND_FBIT_ASR_ANDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , OR */
#define E_COND_FBIT_ASR_OR(cond, dest, roperand, r2shift, shift5)                                                     \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then OR */
#define E_COND_FBIT_ASR_ORS(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , XOR */
#define E_COND_FBIT_ASR_XOR(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then XOR */
#define E_COND_FBIT_ASR_XORS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , ADD */
#define E_COND_FBIT_ASR_ADD(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then ADD */
#define E_COND_FBIT_ASR_ADDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , SUB */
#define E_COND_FBIT_ASR_SUB(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then SUB */
#define E_COND_FBIT_ASR_SUBS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , ADC */
#define E_COND_FBIT_ASR_ADC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then ADC */
#define E_COND_FBIT_ASR_ADCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (1 << 19)

/* Conditional Flip Bitwise , ASR , SBC */
#define E_COND_FBIT_ASR_SBC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (1 << 19)
/* Conditional Flip Bitwise , ASR ,Set Flag then SBC */
#define E_COND_FBIT_ASR_SBCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (1 << 19)

/* Flip Endian , LSR Right */
#define E_FEND_LSR(dest, r2shift, shift5)                                                                    \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag */
#define E_FEND_LSRS(dest, r2shift, shift5)                                                                   \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , AND */
#define E_FEND_LSR_AND(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then AND */
#define E_FEND_LSR_ANDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , OR */
#define E_FEND_LSR_OR(dest, roperand, r2shift, shift5)                                                              \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then OR */
#define E_FEND_LSR_ORS(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , XOR */
#define E_FEND_LSR_XOR(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then XOR */
#define E_FEND_LSR_XORS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , ADD */
#define E_FEND_LSR_ADD(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then ADD */
#define E_FEND_LSR_ADDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , SUB */
#define E_FEND_LSR_SUB(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then SUB */
#define E_FEND_LSR_SUBS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , ADC */
#define E_FEND_LSR_ADC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then ADC */
#define E_FEND_LSR_ADCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (0 << 19)

/* Flip Endian , LSR Right , SBC */
#define E_FEND_LSR_SBC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (0 << 19)
/* Flip Endian , LSR Right ,Set Flag then SBC */
#define E_FEND_LSR_SBCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (0 << 19)

/* Conditional */
/* Conditional Flip Endian , LSR */
#define E_COND_FEND_LSR(cond, dest, r2shift, shift5)                                                           \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag */
#define E_COND_FEND_LSRS(cond, dest, r2shift, shift5)                                                          \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , AND */
#define E_COND_FEND_LSR_AND(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then AND */
#define E_COND_FEND_LSR_ANDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (0 << 18) + (0 << 19)

