RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Conditional Flip Endian , LSR , OR */
#define E_COND_FEND_LSR_OR(cond, dest, roperand, r2shift, shift5)                                                     \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then OR */
#define E_COND_FEND_LSR_ORS(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , XOR */
#define E_COND_FEND_LSR_XOR(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then XOR */
#define E_COND_FEND_LSR_XORS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , ADD */
#define E_COND_FEND_LSR_ADD(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then ADD */
#define E_COND_FEND_LSR_ADDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , SUB */
#define E_COND_FEND_LSR_SUB(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then SUB */
#define E_COND_FEND_LSR_SUBS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , ADC */
#define E_COND_FEND_LSR_ADC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then ADC */
#define E_COND_FEND_LSR_ADCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (0 << 18) + (0 << 19)

/* Conditional Flip Endian , LSR , SBC */
#define E_COND_FEND_LSR_SBC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (0 << 19)
/* Conditional Flip Endian , LSR ,Set Flag then SBC */
#define E_COND_FEND_LSR_SBCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (0 << 18) + (0 << 19)

/* Bitwise Flip LSR */

/* Flip Bitwise , LSR Right */
#define E_FBIT_LSR(dest, r2shift, shift5)                                                                    \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag */
#define E_FBIT_LSRS(dest, r2shift, shift5)                                                                   \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , AND */
#define E_FBIT_LSR_AND(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then AND */
#define E_FBIT_LSR_ANDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , OR */
#define E_FBIT_LSR_OR(dest, roperand, r2shift, shift5)                                                              \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then OR */
#define E_FBIT_LSR_ORS(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , XOR */
#define E_FBIT_LSR_XOR(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then XOR */
#define E_FBIT_LSR_XORS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , ADD */
#define E_FBIT_LSR_ADD(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then ADD */
#define E_FBIT_LSR_ADDS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (0 << 19)

