RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Flip Bitwise , LSR Right , SUB */
#define E_FBIT_LSR_SUB(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then SUB */
#define E_FBIT_LSR_SUBS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , ADC */
#define E_FBIT_LSR_ADC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then ADC */
#define E_FBIT_LSR_ADCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (0 << 19)

/* Flip Bitwise , LSR Right , SBC */
#define E_FBIT_LSR_SBC(dest, roperand, r2shift, shift5)                                                             \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (0 << 19)
/* Flip Bitwise , LSR Right ,Set Flag then SBC */
#define E_FBIT_LSR_SBCS(dest, roperand, r2shift, shift5)                                                            \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (0 << 19)

/* Conditional */
/* Conditional Flip Bitwise , LSR */
#define E_COND_FBIT_LSR(cond, dest, r2shift, shift5)                                                           \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag */
#define E_COND_FBIT_LSRS(cond, dest, r2shift, shift5)                                                          \
    DCD 0x11 + (dest << 10) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + (0 << 29) + \
        (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , AND */
#define E_COND_FBIT_LSR_AND(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then AND */
#define E_COND_FBIT_LSR_ANDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (1 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , OR */
#define E_COND_FBIT_LSR_OR(cond, dest, roperand, r2shift, shift5)                                                     \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then OR */
#define E_COND_FBIT_LSR_ORS(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (2 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , XOR */
#define E_COND_FBIT_LSR_XOR(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then XOR */
#define E_COND_FBIT_LSR_XORS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (3 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , ADD */
#define E_COND_FBIT_LSR_ADD(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then ADD */
#define E_COND_FBIT_LSR_ADDS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (4 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , SUB */
#define E_COND_FBIT_LSR_SUB(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then SUB */
#define E_COND_FBIT_LSR_SUBS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (5 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , ADC */
#define E_COND_FBIT_LSR_ADC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then ADC */
#define E_COND_FBIT_LSR_ADCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (6 << 29) + (1 << 18) + (0 << 19)

/* Conditional Flip Bitwise , LSR , SBC */
#define E_COND_FBIT_LSR_SBC(cond, dest, roperand, r2shift, shift5)                                                    \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (0 << 19)
/* Conditional Flip Bitwise , LSR ,Set Flag then SBC */
#define E_COND_FBIT_LSR_SBCS(cond, dest, roperand, r2shift, shift5)                                                   \
    DCD 0x11 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((shift5 & 0x1f) << 24) + \
        (7 << 29) + (1 << 18) + (0 << 19)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_ANDOR */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                         opcode      Dest            Src1               src2 SFlag */
/*                                                         Cond         SRC3 */

/* ANDOR */
#define E_ANDOR(dest, rsrc, rand, ror) \
    DCD 0x16 + (dest << 10) + (rsrc << 14)(rand << 20) + (0 << 9) + (EU << 5) + (ror << 24)
#define E_ANDORS(dest, rsrc, rand, ror) \
    DCD 0x16 + (dest << 10) + (rsrc << 14)(rand << 20) + (1 << 9) + (EU << 5) + (ror << 24)
#define E_COND_ANDOR(cond, dest, rsrc, rand, ror) \
    DCD 0x16 + (dest << 10) + (rsrc << 14)(rand << 20) + (0 << 9) + (cond << 5) + (ror << 24)
#define E_COND_ANDORS(cond, dest, rsrc, rand, ror) \
    DCD 0x16 + (dest << 10) + (rsrc << 14)(rand << 20) + (1 << 9) + (cond << 5) + (ror << 24)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       E_Shift byte reg Codes */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              src2 SFlag Cond
 */
/*                                                         Imm                    Extra Operation    Left/Right */
/*                                                         Shift/Rotate    Invert */

