RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Logical Shift and then ADD */
#define E_COND_RLSL_ADD(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_ADD(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADD */
#define E_COND_RLSL_ADDS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_ADDS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SUB */
#define E_COND_RLSL_SUB(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_SUB(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SUB */
#define E_COND_RLSL_SUBS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_SUBS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then ADC */
#define E_COND_RLSL_ADC(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_ADC(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then ADC */
#define E_COND_RLSL_ADCS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_ADCS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18)

/* Logical Shift and then SBC */
#define E_COND_RLSL_SBC(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_SBC(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)
/* Logical Shift and Set Flag then SBC */
#define E_COND_RLSL_SBCS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18)
#define E_COND_RLSR_SBCS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18)

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                    Extra Operation */
/*                                                         Left/Right   Shift/Rotate  POSTshift */

/* Logical Shift and then AND */
#define E_AND_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_AND_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then AND */
#define E_AND_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_AND_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then OR */
#define E_OR_RLSL(dest, roperand, r2shift, rshift)                                                                  \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_OR_RLSR(dest, roperand, r2shift, rshift)                                                                  \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then OR */
#define E_OR_RLSLS(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_OR_RLSRS(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then XOR */
#define E_XOR_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_XOR_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then XOR */
#define E_XOR_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_XOR_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

