RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Logical Shift and then ADD */
#define E_ADD_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_ADD_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then ADD */
#define E_ADD_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_ADD_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then SUB */
#define E_SUB_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_SUB_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then SUB */
#define E_SUB_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_SUB_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then ADC */
#define E_ADC_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_ADC_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then ADC */
#define E_ADC_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_ADC_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then SBC */
#define E_SBC_RLSL(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_SBC_RLSR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then SBC */
#define E_SBC_RLSLS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_SBC_RLSRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Conditional */

/* Logical Shift and then AND */
#define E_COND_AND_RLSL(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_AND_RLSR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then AND */
#define E_COND_AND_RLSLS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_AND_RLSRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then OR */
#define E_COND_OR_RLSL(cond, dest, roperand, r2shift, rshift)                                                         \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_OR_RLSR(cond, dest, roperand, r2shift, rshift)                                                         \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then OR */
#define E_COND_OR_RLSLS(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_OR_RLSRS(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

/* Logical Shift and then XOR */
#define E_COND_XOR_RLSL(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_XOR_RLSR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 28)
/* Logical Shift and Set Flag then XOR */
#define E_COND_XOR_RLSLS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (0 << 18) + (1 << 28)
#define E_COND_XOR_RLSRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (0 << 18) + (1 << 28)

