RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Rotate and then ADD */
#define E_ADDN_RROR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then ADD */
#define E_ADDN_RRORS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then SUB */
#define E_SUBN_RROR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then SUB */
#define E_SUBN_RRORS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then ADC */
#define E_ADCN_RROR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then ADC */
#define E_ADCN_RRORS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then SBC */
#define E_SBCN_RROR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then SBC */
#define E_SBCN_RRORS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional */

/* Rotate and then AND */
#define E_COND_ANDN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then AND */
#define E_COND_ANDN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then OR */
#define E_COND_ORN_RROR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then OR */
#define E_COND_ORN_RRORS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then XOR */
#define E_COND_XORN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then XOR */
#define E_COND_XORN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then ADD */
#define E_COND_ADDN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then ADD */
#define E_COND_ADDN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then SUB */
#define E_COND_SUBN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then SUB */
#define E_COND_SUBN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then ADC */
#define E_COND_ADCN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then ADC */
#define E_COND_ADCN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Rotate and then SBC */
#define E_COND_SBCN_RROR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Rotate and Set Flag then SBC */
#define E_COND_SBCN_RRORS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (1 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Arithmetical Shift Codes */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Left/Right
 */
/*                                                         Shift/Rotate  Arith/Shift */

