RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Arith Shift Right and then OR */
#define E_OR_RASR(dest, roperand, r2shift, rshift)                                                                  \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then OR */
#define E_OR_RASRS(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Arith Shift Right and then XOR */
#define E_XOR_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then XOR */
#define E_XOR_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Arith Shift Right and then ADD */
#define E_ADD_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then ADD */
#define E_ADD_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Arith Shift Right and then SUB */
#define E_SUB_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then SUB */
#define E_SUB_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Arith Shift Right and then ADC */
#define E_ADC_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then ADC */
#define E_ADC_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Arith Shift Right and then SBC */
#define E_SBC_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Arith Shift Right and Set Flag then SBC */
#define E_SBC_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional */

/* Conditional Arith Shift and then AND */
#define E_COND_AND_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then AND */
#define E_COND_AND_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then OR */
#define E_COND_OR_RASR(cond, dest, roperand, r2shift, rshift)                                                         \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then OR */
#define E_COND_OR_RASRS(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then XOR */
#define E_COND_XOR_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then XOR */
#define E_COND_XOR_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then ADD */
#define E_COND_ADD_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then ADD */
#define E_COND_ADD_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then SUB */
#define E_COND_SUB_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then SUB */
#define E_COND_SUB_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then ADC */
#define E_COND_ADC_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then ADC */
#define E_COND_ADC_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/* Conditional Arith Shift and then SBC */
#define E_COND_SBC_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 28)
/* Conditional Arith Shift and Set Flag then SBC */
#define E_COND_SBC_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 28)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Arithmetical Shift Codes with invert ALU */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                         opcode      Dest            Src1              r2shift SFlag
 */
/*                                                         Cond         Imm                   Extra Operation Left/Right
 */
/*                                                         Shift/Rotate  pOSTShift */

