RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Arith Shift Right and then OR */
#define E_ORN_RASR(dest, roperand, r2shift, rshift)                                                                 \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then OR */
#define E_ORN_RASRS(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Arith Shift Right and then XOR */
#define E_XORN_RASR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then XOR */
#define E_XORN_RASRS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Arith Shift Right and then ADD */
#define E_ADDN_RASR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then ADD */
#define E_ADDN_RASRS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Arith Shift Right and then SUB */
#define E_SUBN_RASR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then SUB */
#define E_SUBN_RASRS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Arith Shift Right and then ADC */
#define E_ADCN_RASR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then ADC */
#define E_ADCN_RASRS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Arith Shift Right and then SBC */
#define E_SBCN_RASR(dest, roperand, r2shift, rshift)                                                                \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Arith Shift Right and Set Flag then SBC */
#define E_SBCN_RASRS(dest, roperand, r2shift, rshift)                                                               \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (EU << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional */

/* Conditional Arith Shift and then AND */
#define E_COND_ANDN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then AND */
#define E_COND_ANDN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (1 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then OR */
#define E_COND_ORN_RASR(cond, dest, roperand, r2shift, rshift)                                                        \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then OR */
#define E_COND_ORN_RASRS(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (2 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then XOR */
#define E_COND_XORN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then XOR */
#define E_COND_XORN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (3 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then ADD */
#define E_COND_ADDN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then ADD */
#define E_COND_ADDN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (4 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then SUB */
#define E_COND_SUBN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then SUB */
#define E_COND_SUBN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (5 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then ADC */
#define E_COND_ADCN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then ADC */
#define E_COND_ADCN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (6 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/* Conditional Arith Shift and then SBC */
#define E_COND_SBCN_RASR(cond, dest, roperand, r2shift, rshift)                                                       \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (0 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)
/* Conditional Arith Shift and Set Flag then SBC */
#define E_COND_SBCN_RASRS(cond, dest, roperand, r2shift, rshift)                                                      \
    DCD 0x19 + (dest << 10) + (roperand << 14) + (r2shift << 20) + (1 << 9) + (cond << 5) + ((rshift & 0x1f) << 24) + \
        (7 << 29) + (0 << 19) + (1 << 18) + (1 << 27) + (1 << 28)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Bit Manipulate */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                         opcode      Dest            Src1               src2 SFlag */
/*                                                         Cond         Imm                  Extra Operation ShiftByByte
 */
/*                                                         Neg/Pos Mask */

