RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Bit test by byte */
#define E_BTST(dest, rdata, rbit)                                                                           \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (EU << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (1 << 31)
#define E_BCLR(dest, rdata, rbit)                                                                           \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (EU << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (0 << 31)
#define E_BSET(dest, rdata, rbit)                                                                           \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (EU << 5) + (0 << 24) + (2 << 29) + \
        (1 << 18) + (1 << 31)
#define E_BTOG(dest, rdata, rbit)                                                                           \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (EU << 5) + (0 << 24) + (3 << 29) + \
        (1 << 18) + (1 << 31)

/* Bit test by byte with set flags */
#define E_BTSTS(dest, rdata, rbit)                                                                          \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (EU << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (1 << 31)
#define E_BCLRS(dest, rdata, rbit)                                                                          \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (EU << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (0 << 31)
#define E_BSETS(dest, rdata, rbit)                                                                          \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (EU << 5) + (0 << 24) + (2 << 29) + \
        (1 << 18) + (1 << 31)
#define E_BTOGS(dest, rdata, rbit)                                                                          \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (EU << 5) + (0 << 24) + (3 << 29) + \
        (1 << 18) + (1 << 31)

/* Conditional Bit test by byte */
#define E_COND_BTST(cond, dest, rdata, rbit)                                                                  \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (cond << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (1 << 31)
#define E_COND_BCLR(cond, dest, rdata, rbit)                                                                  \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (cond << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (0 << 31)
#define E_COND_BSET(cond, dest, rdata, rbit)                                                                  \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (cond << 5) + (0 << 24) + (2 << 29) + \
        (1 << 18) + (1 << 31)
#define E_COND_BTOG(cond, dest, rdata, rbit)                                                                  \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (0 << 9) + (cond << 5) + (0 << 24) + (3 << 29) + \
        (1 << 18) + (1 << 31)

/* Conditional Bit test by byte with set flags */
#define E_COND_BTSTS(cond, dest, rdata, rbit)                                                                 \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (cond << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (1 << 31)
#define E_COND_BCLRS(cond, dest, rdata, rbit)                                                                 \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (cond << 5) + (0 << 24) + (1 << 29) + \
        (1 << 18) + (0 << 31)
#define E_COND_BSETS(cond, dest, rdata, rbit)                                                                 \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (cond << 5) + (0 << 24) + (2 << 29) + \
        (1 << 18) + (1 << 31)
#define E_COND_BTOGS(cond, dest, rdata, rbit)                                                                 \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (rbit << 20) + (1 << 9) + (cond << 5) + (0 << 24) + (3 << 29) + \
        (1 << 18) + (1 << 31)

/* Bit test by imm */
#define E_BTST_IMM(dest, rdata, bit5)                                                                                \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (1 << 31)
#define E_BCLR_IMM(dest, rdata, bit5)                                                                                \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (0 << 31)
#define E_BSET_IMM(dest, rdata, bit5)                                                                                \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (2 << 29) + (0 << 18) + \
        (1 << 31)
#define E_BTOG_IMM(dest, rdata, bit5)                                                                                \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (3 << 29) + (0 << 18) + \
        (1 << 31)

/* Bit test by imm with set flags */
#define E_BTST_IMMS(dest, rdata, bit5)                                                                               \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (1 << 31)
#define E_BCLR_IMMS(dest, rdata, bit5)                                                                               \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (0 << 31)
#define E_BSET_IMMS(dest, rdata, bit5)                                                                               \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (2 << 29) + (0 << 18) + \
        (1 << 31)
#define E_BTOG_IMMS(dest, rdata, bit5)                                                                               \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (EU << 5) + ((bit5 & 0x1f) << 24) + (3 << 29) + (0 << 18) + \
        (1 << 31)

