RT-Thread/rt-thread/bsp/nxp/mcx/mcxn/Libraries/MCXN947/MCXN947/drivers/fsl_smartdma_prv.h
/* Conditional Bit test by imm */
#define E_COND_BTST_IMM(cond, dest, rdata, bit5)                                                                       \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (1 << 31)
#define E_COND_BCLR_IMM(cond, dest, rdata, bit5)                                                                       \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (0 << 31)
#define E_COND_BSET_IMM(cond, dest, rdata, bit5)                                                                       \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (2 << 29) + (0 << 18) + \
        (1 << 31)
#define E_COND_BTOG_IMM(cond, dest, rdata, bit5)                                                                       \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (0 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (3 << 29) + (0 << 18) + \
        (1 << 31)

/* Conditional Bit test by imm with set flags */
#define E_COND_BTST_IMMS(cond, dest, rdata, bit5)                                                                      \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (1 << 31)
#define E_COND_BCLR_IMMS(cond, dest, rdata, bit5)                                                                      \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (1 << 29) + (0 << 18) + \
        (0 << 31)
#define E_COND_BSET_IMMS(cond, dest, rdata, bit5)                                                                      \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (2 << 29) + (0 << 18) + \
        (1 << 31)
#define E_COND_BTOG_IMMS(cond, dest, rdata, bit5)                                                                      \
    DCD 0x18 + (dest << 10) + (rdata << 14) + (1 << 9) + (cond << 5) + ((bit5 & 0x1f) << 24) + (3 << 29) + (0 << 18) + \
        (1 << 31)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                      Tight Loop */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

#define E_TIGHT_LOOP(rend, rcount)            DCD 0x1A + (rend << 14) + (rcount << 20)
#define E_COND_TIGHT_LOOP(cond, rend, rcount) DCD 0x1A + (rend << 14) + (rcount << 20) + (cond << 5)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                    Boolean Detect */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                                                Opcode     Dest           Vector/Single NoUpdateRA */
/*                                                                LargeVectors    Cond              Table */

#define E_HOLD            DCD 0x1C + (PC << 10) + (1 << 15) + (0 << 18) + (0 << 19) + (EU << 5)
#define E_COND_HOLD(cond) DCD 0x1C + (PC << 10) + (1 << 15) + (0 << 18) + (0 << 19) + (cond << 5)

/* Small Vector Versions */
#define E_VECTORED_HOLD(table) DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (0 << 19) + (EU << 5) + (table << 20)
#define E_COND_VECTORED_HOLD(cond, table) \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (0 << 19) + (cond << 5) + (table << 20)
#define E_VECTORED_HOLD_NRA(table) \
    DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (0 << 19) + (EU << 5) + (table << 20)
#define E_COND_VECTORED_HOLD_NRA \
    (cond, table) DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (0 << 19) + (cond << 5) + (table << 20)

/* Large Vector Versions */
#define E_VECTORED_HOLD_LV(table) \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (1 << 19) + (EU << 5) + (table << 20)
#define E_COND_VECTORED_HOLD_LV(cond, table) \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (1 << 19) + (cond << 5) + (table << 20)
#define E_VECTORED_HOLD_LV_NRA(table) \
    DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (1 << 19) + (EU << 5) + (table << 20)
#define E_COND_VECTORED_HOLD_LV_NRA \
    (cond, table) DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (1 << 19) + (cond << 5) + (table << 20)

/*/ Accelarated Vectored_hold */
/* Small Vector Versions */
#define E_ACC_VECTORED_HOLD(table, vectors)                                                               \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (0 << 19) + (EU << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_COND_ACC_VECTORED_HOLD(cond, table, vectors)                                                      \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (0 << 19) + (cond << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_ACC_VECTORED_HOLD_NRA(table, vectors)                                                           \
    DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (0 << 19) + (EU << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_COND_ACC_VECTORED_HOLD_NRA                                                                    \
    (cond, table, vectors) DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (0 << 19) + (cond << 5) + \
        (table << 20) + (1 << 9) + (vectors << 24)

/* Large Vector Versions */
#define E_ACC_VECTORED_HOLD_LV(table, vectors)                                                            \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (1 << 19) + (EU << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_COND_ACC_VECTORED_HOLD_LV(cond, table, vectors)                                                   \
    DCD 0x1C + (table << 10) + (0 << 15) + (0 << 18) + (1 << 19) + (cond << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_ACC_VECTORED_HOLD_LV_NRA(table, vectors)                                                        \
    DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (1 << 19) + (EU << 5) + (table << 20) + (1 << 9) + \
        (vectors << 24)
#define E_COND_ACC_VECTORED_HOLD_LV_NRA                                                                 \
    (cond, table, vectors) DCD 0x1C + (table << 10) + (0 << 15) + (1 << 18) + (1 << 19) + (cond << 5) + \
        (table << 20) + (1 << 9) + (vectors << 24)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Reg offset Read */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                        opcode      Rdata Dest       Pointer         WData Source */
/*                                                        Offset             SizeWord    Signed Access  Cond Write */

/* LDR (Load, Load Byte, LoadByteSigned) */
#define E_LDR_REG(dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (1 << 18) + (0 << 21) + (EU << 5)
#define E_LDR_REGB(dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (0 << 18) + (0 << 21) + (EU << 5)
#define E_LDR_REGBS(dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (0 << 18) + (1 << 21) + (EU << 5)

/* Conditional LDR (Load, Load Byte, LoadByteSigned) */
#define E_COND_LDR_REG(cond, dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (1 << 18) + (0 << 21) + (cond << 5)
#define E_COND_LDR_REGB(cond, dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (0 << 18) + (0 << 21) + (cond << 5)
#define E_COND_LDR_REGBS(cond, dest, source, offset) \
    DCD 0x1D + (dest << 10) + (source << 14) + (offset << 24) + (0 << 18) + (1 << 21) + (cond << 5)

/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                       Reg offset Write */
/*------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

/*                                                       opcode      Rdata Dest         Pointer       WData Source */
/*                                                       Offset             SizeWord    Signed Access  Cond Write */

/* STR (Load, Load Byte, LoadByteSigned) */
#define E_STR_REG(raddr, rdata, roffset) \
    DCD 0x1D + (raddr << 14) + (rdata << 20) + (roffset << 24) + (1 << 18) + (0 << 11) + (EU << 5) + (1 << 30)
#define E_STR_REGB(raddr, rdata, roffset) \
    DCD 0x1D + (raddr << 14) + (rdata << 20) + (roffset << 24) + (0 << 18) + (0 << 11) + (EU << 5) + (1 << 30)

/* Conditional STR (Load, Load Byte, LoadByteSigned) */
#define E_COND_STR_REG(cond, raddr, rdata, roffset) \
    DCD 0x1D + (raddr << 14) + (rdata << 20) + (roffset << 24) + (1 << 18) + (0 << 11) + (cond << 5) + (1 << 30)
#define E_COND_STR_REGB(cond, raddr, rdata, roffset) \
    DCD 0x1D + (raddr << 14) + (rdata << 20) + (roffset << 24) + (0 << 18) + (0 << 11) + (cond << 5) + (1 << 30)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                     GPO modify Byte */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

#define E_MODIFY_GPO_BYTE(andmask, ormask, xormask) DCD 0x1E + (andmask << 8) + (ormask << 16) + (xormask << 24)

/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
/*                                    HeartBeat opcodes */
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/

#define E_HEART_RYTHM_IMM(val16imm) DCD 0x32 + (val16imm << 16)
#define E_HEART_RYTHM(r16bit)       DCD 0x32 + (r16bit << 14) + (1 << 9)
#define E_SYNCH_ALL_TO_BEAT(on1imm) DCD 0x52 + (on1imm << 31)
#define E_WAIT_FOR_BEAT             DCD 0x72

#endif
